AaronPerl/EFM8/Include/efm8_old.h
//------------------------------------------------------------------------------
// Copyright 2014 Silicon Laboratories, Inc.
// All rights reserved. This program and the accompanying materials
// are made available under the terms of the Silicon Laboratories End User
// License Agreement which accompanies this distribution, and is available at
// http://developer.silabs.com/legal/version/v11/Silicon_Labs_Software_License_Agreement.txt
// Original content and implementation provided by Silicon Laboratories.
//------------------------------------------------------------------------------
//Supported Devices:
//  EFM8UB10F16G
//  EFM8UB10F16G
//  EFM8UB10F8G
//  EFM8UB11F16G

#ifndef SI_EFM8UB1_DEFS_H
#define SI_EFM8UB1_DEFS_H

//#include <si_toolchain.h>

//-----------------------------------------------------------------------------
// Register Definitions
//-----------------------------------------------------------------------------
#define ACC        *(uint8_t*) 0xE0 ///< Accumulator                            
#define ADC0AC     *(uint8_t*) 0xB3 ///< ADC0 Accumulator Configuration         
#define ADC0CF     *(uint8_t*) 0xBC ///< ADC0 Configuration                     
#define ADC0CN0    *(uint8_t*) 0xE8 ///< ADC0 Control 0                         
#define ADC0CN1    *(uint8_t*) 0xB2 ///< ADC0 Control 1                         
#define ADC0GTH    *(uint8_t*) 0xC4 ///< ADC0 Greater-Than High Byte            
#define ADC0GTL    *(uint8_t*) 0xC3 ///< ADC0 Greater-Than Low Byte             
#define ADC0H      *(uint8_t*) 0xBE ///< ADC0 Data Word High Byte               
#define ADC0L      *(uint8_t*) 0xBD ///< ADC0 Data Word Low Byte                
#define ADC0LTH    *(uint8_t*) 0xC6 ///< ADC0 Less-Than High Byte               
#define ADC0LTL    *(uint8_t*) 0xC5 ///< ADC0 Less-Than Low Byte                
#define ADC0MX     *(uint8_t*) 0xBB ///< ADC0 Multiplexer Selection             
#define ADC0PWR    *(uint8_t*) 0xDF ///< ADC0 Power Control                     
#define ADC0TK     *(uint8_t*) 0xB9 ///< ADC0 Burst Mode Track Time             
#define B          *(uint8_t*) 0xF0 ///< B Register                             
#define CKCON0     *(uint8_t*) 0x8E ///< Clock Control 0                        
#define CKCON1     *(uint8_t*) 0xA6 ///< Clock Control 1                        
#define CLKSEL     *(uint8_t*) 0xA9 ///< Clock Select                           
#define CMP0CN0    *(uint8_t*) 0x9B ///< Comparator 0 Control 0                 
#define CMP0CN1    *(uint8_t*) 0x99 ///< Comparator 0 Control 1                 
#define CMP0MD     *(uint8_t*) 0x9D ///< Comparator 0 Mode                      
#define CMP0MX     *(uint8_t*) 0x9F ///< Comparator 0 Multiplexer Selection     
#define CMP1CN0    *(uint8_t*) 0xBF ///< Comparator 1 Control 0                 
#define CMP1CN1    *(uint8_t*) 0xAC ///< Comparator 1 Control 1                 
#define CMP1MD     *(uint8_t*) 0xAB ///< Comparator 1 Mode                      
#define CMP1MX     *(uint8_t*) 0xAA ///< Comparator 1 Multiplexer Selection     
#define CRC0CN0    *(uint8_t*) 0xCE ///< CRC0 Control 0                         
#define CRC0CN1    *(uint8_t*) 0x86 ///< CRC0 Control 1                         
#define CRC0CNT    *(uint8_t*) 0xD3 ///< CRC0 Automatic Flash Sector Count      
#define CRC0DAT    *(uint8_t*) 0xDE ///< CRC0 Data Output                       
#define CRC0FLIP   *(uint8_t*) 0xCF ///< CRC0 Bit Flip                          
#define CRC0IN     *(uint8_t*) 0xDD ///< CRC0 Data Input                        
#define CRC0ST     *(uint8_t*) 0xD2 ///< CRC0 Automatic Flash Sector Start      
#define DERIVID    *(uint8_t*) 0xAD ///< Derivative Identification              
#define DEVICEID   *(uint8_t*) 0xB5 ///< Device Identification                  
#define DPH        *(uint8_t*) 0x83 ///< Data Pointer High                      
#define DPL        *(uint8_t*) 0x82 ///< Data Pointer Low                       
#define EIE1       *(uint8_t*) 0xE6 ///< Extended Interrupt Enable 1            
#define EIE2       *(uint8_t*) 0xCE ///< Extended Interrupt Enable 2            
#define EIP1       *(uint8_t*) 0xF3 ///< Extended Interrupt Priority 1 Low      
#define EIP1H      *(uint8_t*) 0xF5 ///< Extended Interrupt Priority 1 High     
#define EIP2       *(uint8_t*) 0xF4 ///< Extended Interrupt Priority 2          
#define EIP2H      *(uint8_t*) 0xF6 ///< Extended Interrupt Priority 2 High     
#define EMI0CN     *(uint8_t*) 0xE7 ///< External Memory Interface Control      
#define FLKEY      *(uint8_t*) 0xB7 ///< Flash Lock and Key                     
#define HFO0CAL    *(uint8_t*) 0xC7 ///< High Frequency Oscillator 0 Calibration
#define HFO1CAL    *(uint8_t*) 0xD6 ///< High Frequency Oscillator 1 Calibration
#define HFOCN      *(uint8_t*) 0xEF ///< High Frequency Oscillator Control      
#define I2C0CN0    *(uint8_t*) 0xBA ///< I2C0 Control                           
#define I2C0DIN    *(uint8_t*) 0xBC ///< I2C0 Received Data                     
#define I2C0DOUT   *(uint8_t*) 0xBB ///< I2C0 Transmit Data                     
#define I2C0FCN0   *(uint8_t*) 0xAD ///< I2C0 FIFO Control 0                    
#define I2C0FCN1   *(uint8_t*) 0xAB ///< I2C0 FIFO Control 1                    
#define I2C0FCT    *(uint8_t*) 0xF5 ///< I2C0 FIFO Count                        
#define I2C0SLAD   *(uint8_t*) 0xBD ///< I2C0 Slave Address                     
#define I2C0STAT   *(uint8_t*) 0xB9 ///< I2C0 Status                            
#define IE         *(uint8_t*) 0xA8 ///< Interrupt Enable                       
#define IP         *(uint8_t*) 0xB8 ///< Interrupt Priority                     
#define IPH        *(uint8_t*) 0xF2 ///< Interrupt Priority High                
#define IT01CF     *(uint8_t*) 0xE4 ///< INT0/INT1 Configuration                
#define LFO0CN     *(uint8_t*) 0xB1 ///< Low Frequency Oscillator Control       
#define P0         *(uint8_t*) 0x80 ///< Port 0 Pin Latch                       
#define P0MASK     *(uint8_t*) 0xFE ///< Port 0 Mask                            
#define P0MAT      *(uint8_t*) 0xFD ///< Port 0 Match                           
#define P0MDIN     *(uint8_t*) 0xF1 ///< Port 0 Input Mode                      
#define P0MDOUT    *(uint8_t*) 0xA4 ///< Port 0 Output Mode                     
#define P0SKIP     *(uint8_t*) 0xD4 ///< Port 0 Skip                            
#define P1         *(uint8_t*) 0x90 ///< Port 1 Pin Latch                       
#define P1MASK     *(uint8_t*) 0xEE ///< Port 1 Mask                            
#define P1MAT      *(uint8_t*) 0xED ///< Port 1 Match                           
#define P1MDIN     *(uint8_t*) 0xF2 ///< Port 1 Input Mode                      
#define P1MDOUT    *(uint8_t*) 0xA5 ///< Port 1 Output Mode                     
#define P1SKIP     *(uint8_t*) 0xD5 ///< Port 1 Skip                            
#define P2         *(uint8_t*) 0xA0 ///< Port 2 Pin Latch                       
#define P2MASK     *(uint8_t*) 0xFC ///< Port 2 Mask                            
#define P2MAT      *(uint8_t*) 0xFB ///< Port 2 Match                           
#define P2MDIN     *(uint8_t*) 0xF3 ///< Port 2 Input Mode                      
#define P2MDOUT    *(uint8_t*) 0xA6 ///< Port 2 Output Mode                     
#define P2SKIP     *(uint8_t*) 0xCC ///< Port 2 Skip                            
#define P3         *(uint8_t*) 0xB0 ///< Port 3 Pin Latch                       
#define P3MDIN     *(uint8_t*) 0xF4 ///< Port 3 Input Mode                      
#define P3MDOUT    *(uint8_t*) 0x9C ///< Port 3 Output Mode                     
#define PCA0CENT   *(uint8_t*) 0x9E ///< PCA Center Alignment Enable            
#define PCA0CLR    *(uint8_t*) 0x9C ///< PCA Comparator Clear Control           
#define PCA0CN0    *(uint8_t*) 0xD8 ///< PCA Control                            
#define PCA0CPH0   *(uint8_t*) 0xFC ///< PCA Channel 0 Capture Module High Byte 
#define PCA0CPH1   *(uint8_t*) 0xEA ///< PCA Channel 1 Capture Module High Byte 
#define PCA0CPH2   *(uint8_t*) 0xEC ///< PCA Channel 2 Capture Module High Byte 
#define PCA0CPL0   *(uint8_t*) 0xFB ///< PCA Channel 0 Capture Module Low Byte  
#define PCA0CPL1   *(uint8_t*) 0xE9 ///< PCA Channel 1 Capture Module Low Byte  
#define PCA0CPL2   *(uint8_t*) 0xEB ///< PCA Channel 2 Capture Module Low Byte  
#define PCA0CPM0   *(uint8_t*) 0xDA ///< PCA Channel 0 Capture/Compare Mode     
#define PCA0CPM1   *(uint8_t*) 0xDB ///< PCA Channel 1 Capture/Compare Mode     
#define PCA0CPM2   *(uint8_t*) 0xDC ///< PCA Channel 2 Capture/Compare Mode     
#define PCA0H      *(uint8_t*) 0xFA ///< PCA Counter/Timer High Byte            
#define PCA0L      *(uint8_t*) 0xF9 ///< PCA Counter/Timer Low Byte             
#define PCA0MD     *(uint8_t*) 0xD9 ///< PCA Mode                               
#define PCA0POL    *(uint8_t*) 0x96 ///< PCA Output Polarity                    
#define PCA0PWM    *(uint8_t*) 0xF7 ///< PCA PWM Configuration                  
#define PCON0      *(uint8_t*) 0x87 ///< Power Control                          
#define PCON1      *(uint8_t*) 0x9A ///< Power Control 1                        
#define PFE0CN     *(uint8_t*) 0xC1 ///< Prefetch Engine Control                
#define PRTDRV     *(uint8_t*) 0xF6 ///< Port Drive Strength                    
#define PSCTL      *(uint8_t*) 0x8F ///< Program Store Control                  
#define PSW        *(uint8_t*) 0xD0 ///< Program Status Word                    
#define REF0CN     *(uint8_t*) 0xD1 ///< Voltage Reference Control              
#define REG0CN     *(uint8_t*) 0xC9 ///< Voltage Regulator 0 Control            
#define REG1CN     *(uint8_t*) 0xC6 ///< Voltage Regulator 1 Control            
#define REVID      *(uint8_t*) 0xB6 ///< Revision Identifcation                 
#define RSTSRC     *(uint8_t*) 0xEF ///< Reset Source                           
#define SBCON1     *(uint8_t*) 0x94 ///< UART1 Baud Rate Generator Control      
#define SBRLH1     *(uint8_t*) 0x96 ///< UART1 Baud Rate Generator High Byte    
#define SBRLL1     *(uint8_t*) 0x95 ///< UART1 Baud Rate Generator Low Byte     
#define SBUF0      *(uint8_t*) 0x99 ///< UART0 Serial Port Data Buffer          
#define SBUF1      *(uint8_t*) 0x92 ///< UART1 Serial Port Data Buffer          
#define SCON0      *(uint8_t*) 0x98 ///< UART0 Serial Port Control              
#define SCON1      *(uint8_t*) 0xC8 ///< UART1 Serial Port Control              
#define SFRPAGE    *(uint8_t*) 0xA7 ///< SFR Page                               
#define SFRPGCN    *(uint8_t*) 0xCF ///< SFR Page Control                       
#define SFRSTACK   *(uint8_t*) 0xD7 ///< SFR Page Stack                         
#define SMB0ADM    *(uint8_t*) 0xD6 ///< SMBus 0 Slave Address Mask             
#define SMB0ADR    *(uint8_t*) 0xD7 ///< SMBus 0 Slave Address                  
#define SMB0CF     *(uint8_t*) 0xC1 ///< SMBus 0 Configuration                  
#define SMB0CN0    *(uint8_t*) 0xC0 ///< SMBus 0 Control                        
#define SMB0DAT    *(uint8_t*) 0xC2 ///< SMBus 0 Data                           
#define SMB0FCN0   *(uint8_t*) 0xC3 ///< SMBus0 FIFO Control 0                  
#define SMB0FCN1   *(uint8_t*) 0xC4 ///< SMBus0 FIFO Control 1                  
#define SMB0FCT    *(uint8_t*) 0xEF ///< SMBus0 FIFO Count                      
#define SMB0RXLN   *(uint8_t*) 0xC5 ///< SMBus0 Receive Length Counter          
#define SMB0TC     *(uint8_t*) 0xAC ///< SMBus 0 Timing and Pin Control         
#define SMOD1      *(uint8_t*) 0x93 ///< UART1 Mode                             
#define SP         *(uint8_t*) 0x81 ///< Stack Pointer                          
#define SPI0CFG    *(uint8_t*) 0xA1 ///< SPI0 Configuration                     
#define SPI0CKR    *(uint8_t*) 0xA2 ///< SPI0 Clock Rate                        
#define SPI0CN0    *(uint8_t*) 0xF8 ///< SPI0 Control                           
#define SPI0DAT    *(uint8_t*) 0xA3 ///< SPI0 Data                              
#define SPI0FCN0   *(uint8_t*) 0x9A ///< SPI0 FIFO Control 0                    
#define SPI0FCN1   *(uint8_t*) 0x9B ///< SPI0 FIFO Control 1                    
#define SPI0FCT    *(uint8_t*) 0xF7 ///< SPI0 FIFO Count                        
#define TCON       *(uint8_t*) 0x88 ///< Timer 0/1 Control                      
#define TH0        *(uint8_t*) 0x8C ///< Timer 0 High Byte                      
#define TH1        *(uint8_t*) 0x8D ///< Timer 1 High Byte                      
#define TL0        *(uint8_t*) 0x8A ///< Timer 0 Low Byte                       
#define TL1        *(uint8_t*) 0x8B ///< Timer 1 Low Byte                       
#define TMOD       *(uint8_t*) 0x89 ///< Timer 0/1 Mode                         
#define TMR2CN0    *(uint8_t*) 0xC8 ///< Timer 2 Control 0                      
#define TMR2CN1    *(uint8_t*) 0xFD ///< Timer 2 Control 1                      
#define TMR2H      *(uint8_t*) 0xCD ///< Timer 2 High Byte                      
#define TMR2L      *(uint8_t*) 0xCC ///< Timer 2 Low Byte                       
#define TMR2RLH    *(uint8_t*) 0xCB ///< Timer 2 Reload High Byte               
#define TMR2RLL    *(uint8_t*) 0xCA ///< Timer 2 Reload Low Byte                
#define TMR3CN0    *(uint8_t*) 0x91 ///< Timer 3 Control 0                      
#define TMR3CN1    *(uint8_t*) 0xFE ///< Timer 3 Control 1                      
#define TMR3H      *(uint8_t*) 0x95 ///< Timer 3 High Byte                      
#define TMR3L      *(uint8_t*) 0x94 ///< Timer 3 Low Byte                       
#define TMR3RLH    *(uint8_t*) 0x93 ///< Timer 3 Reload High Byte               
#define TMR3RLL    *(uint8_t*) 0x92 ///< Timer 3 Reload Low Byte                
#define TMR4CN0    *(uint8_t*) 0x98 ///< Timer 4 Control 0                      
#define TMR4CN1    *(uint8_t*) 0xFF ///< Timer 4 Control 1                      
#define TMR4H      *(uint8_t*) 0xA5 ///< Timer 4 High Byte                      
#define TMR4L      *(uint8_t*) 0xA4 ///< Timer 4 Low Byte                       
#define TMR4RLH    *(uint8_t*) 0xA3 ///< Timer 4 Reload High Byte               
#define TMR4RLL    *(uint8_t*) 0xA2 ///< Timer 4 Reload Low Byte                
#define UART1FCN0  *(uint8_t*) 0x9D ///< UART1 FIFO Control 0                   
#define UART1FCN1  *(uint8_t*) 0xD8 ///< UART1 FIFO Control 1                   
#define UART1FCT   *(uint8_t*) 0xFA ///< UART1 FIFO Count                       
#define UART1LIN   *(uint8_t*) 0x9E ///< UART1 LIN Configuration                
#define USB0ADR    *(uint8_t*) 0xAE ///< USB0 Indirect Address                  
#define USB0AEC    *(uint8_t*) 0xB2 ///< USB0 Advanced Energy Control           
#define USB0CDCF   *(uint8_t*) 0xB6 ///< USB0 Charger Detect Configuration      
#define USB0CDCN   *(uint8_t*) 0xBE ///< USB0 Charger Detect Control            
#define USB0CDSTA  *(uint8_t*) 0xBF ///< USB0 Charger Detect Status             
#define USB0CF     *(uint8_t*) 0xB5 ///< USB0 Configuration                     
#define USB0DAT    *(uint8_t*) 0xAF ///< USB0 Data                              
#define USB0XCN    *(uint8_t*) 0xB3 ///< USB0 Transceiver Control               
#define VDM0CN     *(uint8_t*) 0xFF ///< Supply Monitor Control                 
#define WDTCN      *(uint8_t*) 0x97 ///< Watchdog Timer Control                 
#define XBR0       *(uint8_t*) 0xE1 ///< Port I/O Crossbar 0                    
#define XBR1       *(uint8_t*) 0xE2 ///< Port I/O Crossbar 1                    
#define XBR2       *(uint8_t*) 0xE3 ///< Port I/O Crossbar 2                    
/*
//------------------------------------------------------------------------------
// 16-bit Register Definitions (may not work on all compilers)
//------------------------------------------------------------------------------
SI_SFR16 (ADC0GT,  0xC3); ///< ADC0 Greater-Than            
SI_SFR16 (ADC0,    0xBD); ///< ADC0 Data Word               
SI_SFR16 (ADC0LT,  0xC5); ///< ADC0 Less-Than               
SI_SFR16 (DP,      0x82); ///< Data Pointer                 
SI_SFR16 (PCA0CP0, 0xFB); ///< PCA Channel 0 Capture Module 
SI_SFR16 (PCA0CP1, 0xE9); ///< PCA Channel 1 Capture Module 
SI_SFR16 (PCA0CP2, 0xEB); ///< PCA Channel 2 Capture Module 
SI_SFR16 (PCA0,    0xF9); ///< PCA Counter/Timer            
SI_SFR16 (SBRL1,   0x95); ///< UART1 Baud Rate Generator    
SI_SFR16 (TMR2,    0xCC); ///< Timer 2                      
SI_SFR16 (TMR2RL,  0xCA); ///< Timer 2 Reload               
SI_SFR16 (TMR3,    0x94); ///< Timer 3                      
SI_SFR16 (TMR3RL,  0x92); ///< Timer 3 Reload               
SI_SFR16 (TMR4,    0xA4); ///< Timer 4                      
SI_SFR16 (TMR4RL,  0xA2); ///< Timer 4 Reload               

//------------------------------------------------------------------------------
// Indirect Register Definitions
//------------------------------------------------------------------------------
#define CLKREC   0x0F ///< USB0 Clock Recovery Control       
#define CMIE     0x0B ///< USB0 Common Interrupt Enable      
#define CMINT    0x06 ///< USB0 Common Interrupt             
#define E0CNT    0x16 ///< USB0 Endpoint0 Data Count         
#define E0CSR    0x11 ///< USB0 Endpoint0 Control            
#define EENABLE  0x1E ///< USB0 Endpoint Enable              
#define EINCSRH  0x12 ///< USB0 IN Endpoint Control High     
#define EINCSRL  0x11 ///< USB0 IN Endpoint Control          
#define EOUTCNTH 0x17 ///< USB0 OUT Endpoint Count High      
#define EOUTCNTL 0x16 ///< USB0 OUT Endpoint Count           
#define EOUTCSRH 0x15 ///< USB0 OUT Endpoint Control High    
#define EOUTCSRL 0x14 ///< USB0 OUT Endpoint Control         
#define FADDR    0x00 ///< USB0 Function Address             
#define FIFO0    0x20 ///< USB0 Endpoint 0 FIFO Access       
#define FIFO1    0x21 ///< USB0 Endpoint 1 FIFO Access       
#define FIFO2    0x22 ///< USB0 Endpoint 2 FIFO Access       
#define FIFO3    0x23 ///< USB0 Endpoint 3 FIFO Access       
#define FRAMEH   0x0D ///< USB0 Frame Number High            
#define FRAMEL   0x0C ///< USB0 Frame Number                 
#define IN1IE    0x07 ///< USB0 IN Endpoint Interrupt Enable 
#define IN1INT   0x02 ///< USB0 IN Endpoint Interrupt        
#define INDEX    0x0E ///< USB0 Endpoint Index               
#define OUT1IE   0x09 ///< USB0 OUT Endpoint Interrupt Enable
#define OUT1INT  0x04 ///< USB0 OUT Endpoint Interrupt       
#define POWER    0x01 ///< USB0 Power                        

//------------------------------------------------------------------------------
// Bit Definitions
//------------------------------------------------------------------------------

// ACC (Accumulator)
#define SFR_ACC 0xE0
SI_SBIT (ACC_ACC0, SFR_ACC, 0); ///< Accumulator Bit 0
SI_SBIT (ACC_ACC1, SFR_ACC, 1); ///< Accumulator Bit 1
SI_SBIT (ACC_ACC2, SFR_ACC, 2); ///< Accumulator Bit 2
SI_SBIT (ACC_ACC3, SFR_ACC, 3); ///< Accumulator Bit 3
SI_SBIT (ACC_ACC4, SFR_ACC, 4); ///< Accumulator Bit 4
SI_SBIT (ACC_ACC5, SFR_ACC, 5); ///< Accumulator Bit 5
SI_SBIT (ACC_ACC6, SFR_ACC, 6); ///< Accumulator Bit 6
SI_SBIT (ACC_ACC7, SFR_ACC, 7); ///< Accumulator Bit 7

// ADC0CN0 (ADC0 Control 0)
#define SFR_ADC0CN0 0xE8
SI_SBIT (ADC0CN0_ADCM0,  SFR_ADC0CN0, 0); ///< Start of Conversion Mode Select Bit 0
SI_SBIT (ADC0CN0_ADCM1,  SFR_ADC0CN0, 1); ///< Start of Conversion Mode Select Bit 1
SI_SBIT (ADC0CN0_ADCM2,  SFR_ADC0CN0, 2); ///< Start of Conversion Mode Select Bit 2
SI_SBIT (ADC0CN0_ADWINT, SFR_ADC0CN0, 3); ///< Window Compare Interrupt Flag        
SI_SBIT (ADC0CN0_ADBUSY, SFR_ADC0CN0, 4); ///< ADC Busy                             
SI_SBIT (ADC0CN0_ADINT,  SFR_ADC0CN0, 5); ///< Conversion Complete Interrupt Flag   
SI_SBIT (ADC0CN0_ADBMEN, SFR_ADC0CN0, 6); ///< Burst Mode Enable                    
SI_SBIT (ADC0CN0_ADEN,   SFR_ADC0CN0, 7); ///< ADC Enable                           

// B (B Register)
#define SFR_B 0xF0
SI_SBIT (B_B0, SFR_B, 0); ///< B Register Bit 0
SI_SBIT (B_B1, SFR_B, 1); ///< B Register Bit 1
SI_SBIT (B_B2, SFR_B, 2); ///< B Register Bit 2
SI_SBIT (B_B3, SFR_B, 3); ///< B Register Bit 3
SI_SBIT (B_B4, SFR_B, 4); ///< B Register Bit 4
SI_SBIT (B_B5, SFR_B, 5); ///< B Register Bit 5
SI_SBIT (B_B6, SFR_B, 6); ///< B Register Bit 6
SI_SBIT (B_B7, SFR_B, 7); ///< B Register Bit 7

// IE (Interrupt Enable)
#define SFR_IE 0xA8
SI_SBIT (IE_EX0,   SFR_IE, 0); ///< External Interrupt 0 Enable
SI_SBIT (IE_ET0,   SFR_IE, 1); ///< Timer 0 Interrupt Enable   
SI_SBIT (IE_EX1,   SFR_IE, 2); ///< External Interrupt 1 Enable
SI_SBIT (IE_ET1,   SFR_IE, 3); ///< Timer 1 Interrupt Enable   
SI_SBIT (IE_ES0,   SFR_IE, 4); ///< UART0 Interrupt Enable     
SI_SBIT (IE_ET2,   SFR_IE, 5); ///< Timer 2 Interrupt Enable   
SI_SBIT (IE_ESPI0, SFR_IE, 6); ///< SPI0 Interrupt Enable      
SI_SBIT (IE_EA,    SFR_IE, 7); ///< All Interrupts Enable      

