AaronPerl/EFM8/Include/efm8_old.h
// UART1FCN1 (UART1 FIFO Control 1)
#define SFR_UART1FCN1 0xD8
SI_SBIT (UART1FCN1_RIE,    SFR_UART1FCN1, 0); ///< Receive Interrupt Enable 
SI_SBIT (UART1FCN1_RXTO0,  SFR_UART1FCN1, 1); ///< Receive Timeout Bit 0    
SI_SBIT (UART1FCN1_RXTO1,  SFR_UART1FCN1, 2); ///< Receive Timeout Bit 1    
SI_SBIT (UART1FCN1_RFRQ,   SFR_UART1FCN1, 3); ///< Receive FIFO Request     
SI_SBIT (UART1FCN1_TIE,    SFR_UART1FCN1, 4); ///< Transmit Interrupt Enable
SI_SBIT (UART1FCN1_TXHOLD, SFR_UART1FCN1, 5); ///< Transmit Hold            
SI_SBIT (UART1FCN1_TXNF,   SFR_UART1FCN1, 6); ///< TX FIFO Not Full         
SI_SBIT (UART1FCN1_TFRQ,   SFR_UART1FCN1, 7); ///< Transmit FIFO Request    

//------------------------------------------------------------------------------
// Interrupt Definitions
//------------------------------------------------------------------------------
#define INT0_IRQn    0  ///< External Interrupt 0      
#define TIMER0_IRQn  1  ///< Timer 0 Overflow          
#define INT1_IRQn    2  ///< External Interrupt 1      
#define TIMER1_IRQn  3  ///< Timer 1 Overflow          
#define UART0_IRQn   4  ///< UART0                     
#define TIMER2_IRQn  5  ///< Timer 2 Overflow / Capture
#define SPI0_IRQn    6  ///< SPI0                      
#define SMBUS0_IRQn  7  ///< SMBus0                    
#define PMATCH_IRQn  8  ///< Port Match                
#define ADC0WC_IRQn  9  ///< ADC0 Window Compare       
#define ADC0EOC_IRQn 10 ///< ADC0 End of Conversion    
#define PCA0_IRQn    11 ///< PCA0                      
#define CMP0_IRQn    12 ///< Comparator 0              
#define CMP1_IRQn    13 ///< Comparator 1              
#define TIMER3_IRQn  14 ///< Timer 3 Overflow / Capture
#define USB0_IRQn    15 ///< USB0 Events               
#define VBUS_IRQn    16 ///< VBUS / USB Charge Detect  
#define UART1_IRQn   17 ///< UART1                     
#define I2C0_IRQn    18 ///< I2C0 Slave                
#define TIMER4_IRQn  19 ///< Timer 4 Overflow / Capture

//------------------------------------------------------------------------------
// SFR Page Definitions
//------------------------------------------------------------------------------
#define CRC0_PAGE      0x00 ///< CRC0 Page       
#define LEGACY_PAGE    0x00 ///< Legacy SFR Page 
#define PCA0_PAGE      0x00 ///< PCA0 Page       
#define PG2_PAGE       0x10 ///< Page2           
#define TIMER2_PAGE    0x10 ///< Timer 2 Page    
#define TIMER3_PAGE    0x10 ///< Timer 3 Page    
#define TIMER4_PAGE    0x10 ///< Timer 4 Page    
#define I2CSLAVE0_PAGE 0x20 ///< I2C Slave 0 Page
#define PG3_PAGE       0x20 ///< Page3           
#define SMB0_PAGE      0x20 ///< SMBus 0 Page    
#define SPI0_PAGE      0x20 ///< SPI0 Page       
#define UART0_PAGE     0x20 ///< UART0 Page      
#define UART1_PAGE     0x20 ///< UART1 Page      
#define USB0_PAGE      0x20 ///< USB0 Page       

//-----------------------------------------------------------------------------
// SDCC PDATA External Memory Paging Support
//-----------------------------------------------------------------------------
*/
#if defined SDCC

//SI_SFR(_XPAGE, 0xAA); // Point to the EMI0CN register

#endif

#endif // SI_EFM8UB1_DEFS_H
//-eof--------------------------------------------------------------------------

